var fruits = [{
    "name": "不限1",
    "list": [{
        "name": "不限1",
        "list2": ["不限1"]
    }]
},
{
    "name": "水果2",
    "list": [{
            "name": "不限2",
            "list2": ["不限2"]
        },
        {
            "name": "果树类2",
            "list2": ["不限2", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        },
        {
            "name": "浆果类22",
            "list2": ["不限22", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        }
    ]
},
{
    "name": "蔬菜3",
    "list": [{
            "name": "蔬菜3",
            "list2": ["不限3", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        },
        {
            "name": "浆果33",
            "list2": ["不限33", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        }
    ]
},
{
    "name": "梁作",
    "list": [{
            "name": "梁作4",
            "list2": ["不限4", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        },
        {
            "name": "梁作44",
            "list2": ["不限44", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        }
    ]
},
{
    "name": "茶叶",
    "list": [{
            "name": "茶叶5",
            "list2": ["不限5", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        },
        {
            "name": "茶叶55",
            "list2": ["不限55", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        }
    ]
},
{
    "name": "中草药",
    "list": [{
            "name": "中草药6",
            "list2": ["不限6", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        },
        {
            "name": "中草药66",
            "list2": ["不限66", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        }
    ]
},
{
    "name": "坚果干果",
    "list": [{
            "name": "坚果干果1",
            "list2": ["不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        },
        {
            "name": "坚果干果2",
            "list2": ["不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        }
    ]
},
{
    "name": "其他",
    "list": [{
            "name": "其他1",
            "list2": ["不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        },
        {
            "name": "其他2",
            "list2": ["不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他", "不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
        }
    ]
}
]