var fruits = [{
		"city": [{
				"name": "柑橘类",
				"area": ["不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他","不限", "橙子", "柑橘", "沙糖桔", "金桔", "其他"]
			},
			{
				"name": "浆果类",
				"area": ["猕猴桃", "桃子", "医学院站", "三台子站", "陵西站", "新乐遗址站", "北陵公园站", "中医药大学站", "岐山路站", "沈阳北站", "金融中心站", "市府广场站", "青年大街站", "青年公园站", "工业展览馆站", "市图书馆站", "五里河站", "奥体中心站", "营盘街站", "世纪大厦站", "白塔河路站", "全运路站"]
			}
		]
	},
	{
		"city": [{
				"name": "水果",
				"area": ["核桃", "板栗", "七号街站", "四号街站", "张士站", "开发大道站", "于洪广场站", "迎宾路站", "重工街站", "启工街站", "保工街站", "铁西广场站", "云峰北街站", "沈阳站站", "太原街站", "南市场站", "青年大街站", "怀远门站", "中街站", "东中街站", "滂江街站", "黎明广场站"]
			},
			{
				"name": "浆果类",
				"area": ["猕猴桃", "桃子", "医学院站", "三台子站", "陵西站", "新乐遗址站", "北陵公园站", "中医药大学站", "岐山路站", "沈阳北站", "金融中心站", "市府广场站", "青年大街站", "青年公园站", "工业展览馆站", "市图书馆站", "五里河站", "奥体中心站", "营盘街站", "世纪大厦站", "白塔河路站", "全运路站"]
			}
		]
	},
	{
		"city": [{
				"name": "水果",
				"area": ["核桃", "板栗", "七号街站", "四号街站", "张士站", "开发大道站", "于洪广场站", "迎宾路站", "重工街站", "启工街站", "保工街站", "铁西广场站", "云峰北街站", "沈阳站站", "太原街站", "南市场站", "青年大街站", "怀远门站", "中街站", "东中街站", "滂江街站", "黎明广场站"]
			},
			{
				"name": "浆果类",
				"area": ["猕猴桃", "桃子", "医学院站", "三台子站", "陵西站", "新乐遗址站", "北陵公园站", "中医药大学站", "岐山路站", "沈阳北站", "金融中心站", "市府广场站", "青年大街站", "青年公园站", "工业展览馆站", "市图书馆站", "五里河站", "奥体中心站", "营盘街站", "世纪大厦站", "白塔河路站", "全运路站"]
			}
		]
	}
]